[{"title":"相信你的团队并给予足够的空间，释放整个团队的生产力","date":"2017-02-26T12:00:00.000Z","path":"2017/02/26/beleive-your-team-and-give-them-free-space/","text":"相信大家在一个飞速发展变化的环境下，经常遇到这样一个问题：技术和产品往往变更太快，作为一个基层技术主管，常常需要在很短的时间内进行各种业务和技术会议，可能是小组的，也可能是部门的，你不可能有时间参加所有的会议，制定所有的方案，以及制定方案的细节，做出所有的决策，同时，你自己还有一些其它同样重要的事需要去做，例如团队人员的管理，部门事务的辅助推进等等，如果都是自己一个人来处理，是根本均衡不过来的。 那么如何平衡这些问题？我要分享的是在这个问题上我自己的一些看法和做法，它目前看来获得了一定好的效果。 最核心的做法，就是部分放权给一线的小伙伴，每个人不仅仅是实现，还包含更多的讨论、设计和决策。在这里有几个关键的要点： 第一，管理者亦为师者 身为一个管理者，不仅仅只是为了完成一些公司和团队的业务目标，那些只是一些基础的要求。有一句话，在我刚刚管理团队的时候，是我老大对我说的，我印象很深刻，大意是，作为团队的管理者，不一定你技术或者某一项能力就比团队中所有人强，你能够作为管理者，往往是由于你掌握的信息量高于团队中所有人，你才能够引导你的团队。我有机会能够和层次更高的人交流，参与决策，那么我更容易知道整个公司技术团队和我所属的部门对待同一领域问题更加准确的看法，以及如何形成这样的看法，这个思考的过程很重要。以及我在这些事情上积累了足够多而且有效的经验。那么我要做的是： 分享，即使客观事实是信息会成倒金字塔形式在传播，但是，也应该向团队传递足够的信息，特别是失败教训和成功经验。另外，应该告诉团队中的成员，一个问题，自己是从什么角度来思考的，自己会采取怎么样的决策。比如，还有每次周会，由小伙伴互相分享这种处理的问题，我可能会做出一些评价。还有不定期组织的一些技术分享会和办事的经验之谈。另外，还有一对一交流的时候，有时候会分享自己的心理历程等等。 引导和助推，我的团队其中一个职责就是负责订单主流程服务，由于组织架构和业务形态的关系，一个简单的改动往往需要和大量的其它所有业务团队交流，每一个变化，都影响深远。我们会经常和平台架构师、其它部门产品和技术负责人产生争执，这是非常正常的。同时，也是非常宝贵的，可以被好好利用起来。在一开始，某些不是很有经验的小伙伴，会随着一起参与会议，这个过程长短因人而异，一开始他们可能是不参与发言的，但这没关系，他们最重要的，是感受、观察和吸收。之后的一些讨论，仍然是我们一起参与，但是，会逐渐变成我只听的，由他们参与发言，我只要在关键的、有必要的地方控制就可以。会后会再和小伙伴沟通，这一次会议，他需要注意的一些点。最后，当小伙伴也积累了足够的经验的时候，就可以让他独自参与一些会议，最后只检查会议结论即可，其实通常这时候只是为了让自己也能了解必要信息而已。 团队必须存在培养的过程，一个凝聚力和战斗力很强的团队，整体的思维方式和采取的行为，都是比较相近一致的。 第二，足够信任小伙伴们 要做到相信，第一步是很关键很重要的基石。除此之外，我们招聘的要求很高，把关也非常严格，我们宁愿花三四倍的力气招到一个综合素质非常优秀的人。那么，我有理由相信，现在的小伙伴，几乎都是有追求的，不管是技术还是生活的追求，大多数人都是上进并且想让自己的价值有所体现的。在后边用鞭子使劲抽和督促，可能只能办好眼前的事情。 给予信念，其实大家都可能会怀疑说信念太虚，但是信念往往影响一些人的主观意识，进而影响行动，例如，我们大肆宣导主人翁意识和狼性，告诉小伙伴，他们做出的贡献给团队和公司以及每一个使用我们产品的人所带来的收益。例如，订单处理流程的每一个细小改变，都将会影响到百万以上的用户，这是坐在办公室编码，一开始就接触了这样体量的人，不会轻易意识到的。虽然我们现在不完美，但是我们追求极致，努力做好每一步。 经常沟通，知道他们的心理诉求和期望，也让他们知道我的诉求和期望。我通常会每个季度和每个人有至少一次的一对一沟通，关注他们的心理变化和近期状态。最好的形态就是，我期望的，和大家期望的，是有交集并能够匹配的。 信任的结果，通常会有预期之外的收获。但是，需要注意的是，信任还有一个重要的前提，自己得能够承受可能带来的损失和不良影响。 第三，放手和分流压力。 为自己抓住机会，也为小伙伴争取机会。如果信任小伙伴，就给出机会，放手让他们自己往前冲，给予足够的权利和强调责任的重要性。自己在有必要的时候，在后边推一把。在过去的大半年里，我们部门推行了很多项目，我的团队里，也推行了很多事情。我会将一个体系的事情，交给某一个人来整体负责，直接对外承担压力，如果这个事情很难，我会在一开始就予以说明，并且告诉他，他可以寻求哪些帮助。当然，通常压力和超出现有能力的挑战，能够让大家成长得更快，在这里压力必须是要提前说清楚的，让大家有所准备，否则，有可能导致小伙伴后边的情绪容易波动，或者最后有一个非常不好的结果。 虽然，这些事情，看似免不了自己在后边还要花费很多时间和精力助推，但是，好处是，比较容易让每一个人都能有很大进步和成长，独挡一面，在一段时间之后，自己就能够解放出来做很多更利于团队发展的事情。自己只参与最关键最核心，非自己不可的事情。 现在我的团队，每个人都负责一块极其重要的业务，对这些业务，他们有着几乎100%技术主导权，我不需要也不会去关注每一块的具体实现细节，大家做出来的决策经常会比我想的更好。同时，虽然我是主管，但是，每个人所要做的事情，都是他们自己安排和规划的，我不需要花费精力来拆解任务，只要不是很不合理的安排，我都会给予充分的自由。有组织性的放养，我只在一些大的层面把控，现在看起来大家平均加班时间也都变少了，整体战斗力也比较高。 在这里，我很感激我的部门老大，因为很多我现在的思维方式和言行，都受到了他的影响，在管理和办事上，教授了我很多东西，并让我得以运用。","tags":[{"name":"管理","slug":"管理","permalink":"http://linktime.github.io/tags/管理/"}]}]